import { SightMock } from '@/app/types/sight';
import coverDesktop from './cover_desktop.jpg';
import coverMobile from './cover_mobile.jpg';
import gallery1 from './gallery/1.jpg';
import gallery2 from './gallery/2.jpg';
import gallery3 from './gallery/3.jpg';
import gallery4 from './gallery/4.jpg';
import gallery5 from './gallery/5.jpg';
import gallery6 from './gallery/6.jpg';
import gallery7 from './gallery/7.jpg';
import gallery8 from './gallery/8.jpg';
import gallery9 from './gallery/9.jpg';
import gallery10 from './gallery/10.jpg';
import gallery11 from './gallery/11.webp';
import gallery12 from './gallery/12.jpg';
import gallery13 from './gallery/13.jpg';
import gallery14 from './gallery/14.webp';
import gallery15 from './gallery/15.jpg';
import gallery16 from './gallery/16.jpg';
import gallery17 from './gallery/17.webp';

export const mockGornolyzhnyiKompleksKrasnayaGlinka: SightMock = {
  id: 'gornolyzhnyi-kompleks-krasnaya-glinka',
  description:
    'Первая горнолыжная зона Самары, работающая с 1973 года. Расположен на берегу Волги, устойчивый микроклимат: когда в городе слякоть, здесь держится минус и снег лежит до весны.',
  location: 'Самара',
  card: {
    generalInfo: {
      title: 'Горнолыжный комплекс «Красная Глинка»',
      imageUrl: coverDesktop.src,
      imageUrlMobile: coverMobile.src,
      address:
        'Самарская область, Самара, Красная Глинка пос.  3-й квартал 37 стр. 1 (нижняя площадка), ул. Батайская, 18б (верхняя площадка)',
      openingHours: 'зима - https://glksok.ru/schedule/ лето - с 10.00 до 20.00 ежедневно, кроме понедельника',
      phone: '+7 (917) 816-12-12',
      website: 'https://glksok.ru/',
      price: 'Зима - https://glksok.ru/prices/ Лето -https://vk.ru/@glksok-price-2025-2026',
    },
    map: {
      lat: 53.389639,
      lng: 50.172732,
    },
    facts: [
      '«Лыжная трасса – это место, где физические возможности встречаются с силой духа, и второе всегда важнее» (с) Маркус Крамер, немецкий тренер сборной России по лыжным гонкам<br>Основан в 1973 г. Установлен первый бугельный подъёмник и открыта детско-юношеская спортивная школа.',
      'Расположен в посёлке Красная Глинка, склоны горы Кузнецова (Сокольи горы), северная часть Самары, берег Волги.',
      '10 трасс общей длиной 6,4 км, перепад высот — 143 м. Самая длинная трасса — 1250 м.',
      '9 подъёмников, включая четырёхместный кресельный (скорость до 2,6 м/с) и бугельные.',
      'Искусственное оснежение обеспечивает катание независимо от погоды.',
      'Сертификация - внесён во всероссийский реестр объектов спорта РФ, что позволяет проводить соревнования всероссийского уровня и присваивать спортивные разряды.',
      'Инфраструктура - две площадки («Верхняя» и «Нижняя»), кафе, прокат, инструкторы, медпункт, парковки.',
      'Регулярные соревнования по горным лыжам и сноуборду («Весенние Зайчики», «Жемчужина России», фристайл-контест «Берёзовый сок»).',
      'Доступен - по будням курсирует бесплатный шаттл от станции метро «Российская».',
    ],
    history: {
      items: [
        'В 1973 году на склоне Сокольих гор был установлен первый бугельный подъёмник и открыта детско-юношеская спортивная школа. С 1986 года планировалось серьёзное освоение территории, но смена политического режима в России чуть было не закрыла эту жемчужину. Возможно, это место спасло регулярное проведение части этапов всероссийских соревнований «Жемчужина России», которые с 1992 года начала проводить Федерация горнолыжного спорта и сноубординга России. В 2003 году началось строительство современного комплекса, а в 2009-м группа компаний «СОК» приобрела соседний объект, объединив активы. Для разработки плана развития пригласили специалиста из Австрии; была внедрена система искусственного оснежения, установлен четырёхместный кресельный подъёмник на высоту 143 м., обновлено освещение.',
        'Комплекс расположен на горе Кузнецова и образует две функциональные зоны – «Верхнюю» и «Нижнюю» площадки. На каждой есть парковка, кассы, прокат, инструкторы, кафе и медпункт. Десять трасс разного уровня сложности — от учебных «зелёных» до требовательных «красных» - проложены по естественному рельефу, защищённому лесом от ветра. Среди местных закрепились неформальные названия: «Креселка» (8-я трасса), «Юг» (1-я), «Север» (4-я, самая сложная). Сноупарк включает трамплины, рейлы и другие фигуры для фристайла.',
        'Помимо трасс, на территории работают тёплые раздевалки, сервисный центр по ремонту инвентаря, детская игровая комната. Для семей с детьми оборудован пологий учебный спуск с инструкторами. Летом комплекс не простаивает: часть инфраструктуры используется для активного отдыха, включая аквазону.',
        'Комплекс расположен в черте г.Самары, что позволяет добраться до комплекса на общественном транспорте. Зимой по будням на комплекс курсирует бесплатный шаттл “Скибусик”.',
      ],
      quote:
        '«При спуске на горных лыжах либо думай быстрее, чем едешь, либо езжай медленнее, чем думаешь.» (с) Владимир Львович Белиловский, альпинист, ветеран горнолыжного спорта и туризма',
    },
    legends: [
      '«Зимний спорт – это лучший способ полюбить зиму вместо того, чтобы ждать весну»',
      'Одна из легенд гласит, что в 1927 году вдоль берегов Волги проплывал пароход, пассажиром которого был Михаил Калинин, и он заинтересовался местом для строительства здравницы.',
      'В 2010-х годах обсуждался проект канатной железной дороги от станции Красная Глинка до Жигулёвского моря, но он не был реализован.',
      'На противоположном берегу Волги возвышается горная цепь легендарных Жигулей и поэтому это место, где и правый, и левый берега поднимаются высокими горами, именуется “Жигулевскими воротами”. Если внимательнее оглядеться в этом месте, нетрудно заметить неповторимую атмосферу – вы катаетесь с панорамным видом на великую реку, Жигулёвские горы и заснеженные леса.',
      'Здесь часто родители впервые ставят на лыжи своих детей, а те, кто когда-то начинал сам, теперь делятся опытом с друзьями.',
      'Преодолеть страх и радоваться первому спуску без падения – возможно это для некоторых станет эффективным методом обогащения своей жизни чувством свободы и возможностей.',
    ],
    gallery: [
      gallery1,
      gallery2,
      gallery3,
      gallery4,
      gallery5,
      gallery6,
      gallery7,
      gallery8,
      gallery9,
      gallery10,
      gallery11,
      gallery12,
      gallery13,
      gallery14,
      gallery15,
      gallery16,
      gallery17,
    ].map((image) => image.src),
  },
};
