import { SightMock } from '@/app/types/sight';
import coverDesktop from './cover_desktop.jpg';
import coverMobile from './cover_mobile.jpg';
import gallery1 from './gallery/1.jpg';
import gallery2 from './gallery/2.jpg';
import gallery3 from './gallery/3.jpg';
import gallery4 from './gallery/4.jpg';
import gallery5 from './gallery/5.jpg';
import gallery6 from './gallery/6.jpg';
import gallery7 from './gallery/7.webp';
import gallery8 from './gallery/8.jpg';
import gallery9 from './gallery/9.jpg';
import gallery10 from './gallery/10.jpg';
import gallery11 from './gallery/11.jpg';
import gallery12 from './gallery/12.jpg';
import gallery13 from './gallery/13.jpg';
import gallery14 from './gallery/14.jpg';
import gallery15 from './gallery/15.jpg';
import gallery16 from './gallery/16.jpg';
import gallery17 from './gallery/17.jpg';
import gallery18 from './gallery/18.jpg';
import gallery19 from './gallery/19.jpg';
import gallery20 from './gallery/20.jpg';
import gallery21 from './gallery/21.jpg';
import gallery22 from './gallery/22.jpg';
import gallery23 from './gallery/23.jpg';
import gallery24 from './gallery/24.jpg';

export const mockSamarskayaIstoricheskayaMechet: SightMock = {
  id: 'samarskaya-istoricheskaya-mechet',
  description:
    'Мечеть с 1891 года как памятник архитектуры, десятилетия забвения и масштабная реставрация. Сегодня – 38-метровый минарет и музей культурного наследия мусульман Самары.',
  location: 'Самара',
  card: {
    generalInfo: {
      title: 'Самарская историческая мечеть',
      imageUrl: coverDesktop.src,
      imageUrlMobile: coverMobile.src,
      address: 'Самарская область, г. Самара, ул. Алексея Толстого, 61',
      openingHours: 'ежедневно 9:00 - 19:00',
      phone: '+7 (846) 340-74-65',
      website: 'https://www.tarihi-mechet.ru/',
      price: 'бесплатно',
    },
    map: {
      lat: 53.18707,
      lng: 50.084229,
    },
    facts: [
      '«Тот, кто сделал добро весом в мельчайшую частицу, увидит его» (с) Сура 99, аят 7.<br>Построена в 1891 году на улице Казанской (ныне – улица Алексея Толстого, 61А), один из старейших мусульманских храмов Поволжья (&gt;135 лет).',
      'Основатель - Симбирский фабрикант и меценат Тимербулат Курамшевич Акчурин (1826–1906 ~80 лет).',
      'Архитектура в мавританском стиле. Проект расширения с куполом и минаретом от архитектора С.В. Смирнова, 1903 г.',
      'Здесь первый в Российской империи экономический журнал «Икътисад» на татарском языке в 1908–1913 годах (5 лет) издавал Имам Мухаммедфатих Муртазин.',
      '~70 лет мечеть была недоступна для верующих (1932-1990), в советский период отдали под детский сад.',
      'Реставрация с 2008 года. Открытие – октябрь 2022 года.',
      'Высота минарета – 38 метров. Вид на Волгу и центр Самары.',
      'Вместимость – до1000 человек одновременно.',
      'Музей «Жизнь и быт самарских мусульман в XIX–XX веках» работает с апреля 2016 года.',
      'Лучший в конкурсе «Архитектурное наследие» - проект реставрации минарета.',
    ],
    history: {
      items: [
        'Самарская историческая мечеть – старейший мусульманский храм Поволжья, ведущий свою историю с 1891 года. Двухэтажное каменное здание было построено на средства симбирского фабриканта Тимербулата Акчурина на улице Казанской. В конце XIX – начале XX века мечеть являлась центром духовной жизни самарских мусульман: при ней действовали мусульманские школы, библиотека и благотворительное общество.',
        'В 1903 году архитектор С.В. Смирнов разработал эскизный проект расширения мечети в «мавританском» стиле с возведением двух кирпичных пристроек, купола и минарета. Однако при жизни дореволюционной России этот проект не был полностью реализован.',
        'После революции 1917 года мечеть национализировали. В 1932 году имама Мухаммедфатиха Муртазина арестовали, а здание отдали под детский сад. Около 70 лет мечеть была недоступна для верующих. Лишь в 2005 году здание вернули мусульманской общине.',
        'Реставрация длилась 14 лет с 2008 по 2022 годы на основе исторических эскизов архитектора С.В. Смирнова от 1903 года. В ходе работ были укреплены фундаменты (установлено более 200 буронабивных свай), заменены все инженерные сети, к историческому зданию пристроены два двухэтажных корпуса – с куполом и с 38-метровым минаретом, откуда открывается панорамный вид на Волгу и центр областной столицы. Одновременно в мечети могут находиться до тысячи человек.',
        'Сегодня мечеть – действующий религиозный центр и музей. В интерьере восстановлена лепнина по эскизам 1903 года, созданы мозаичные панно, в том числе с аятами Корана, выполненные мастерами из Ташкента. При мечети действует библиотека с читальным залом, где собраны Кораны, тафсиры, хадисы и старинные книги. В музее представлены документы, мебель, старинная одежда, сельскохозяйственные орудия, домашняя утварь, самовары и кумганы.',
        '«Обратите внимание на минарет, который возвышается в самом сердце Самары!» – экскурсоводы туристических лайнеров, проходящих через город.',
        '«Это здание, безусловно, украшает столицу нашего региона, служит духовным символом, укрепляющим веру, объединяющим людей вокруг традиций Ислама» – губернатор Самарской области Дмитрий Азаров на церемонии открытия.',
        '«Восстановление этой мечети, в которую было вложено столько сил, любви и радости – это восстановление самих себя» – Верховный муфтий Талгат Сафа Таджуддин.',
      ],
      quote: '«Тот, кто сделал добро весом в мельчайшую частицу, увидит его» (с) Сура 99, аят 7.',
    },
    legends: [
      'Один из наиболее интригующих сюжетов в истории мечети – парадоксальная роль советского детского сада. В 1932 году, когда по всей стране закрывались и разрушались культовые сооружения, здание мечети было отдано под детский сад. В материалах официального сайта мечети отмечается: «Но, возможно, именно это спасло здание от полного уничтожения». Эта двусмысленная ситуация – когда советская власть, массово уничтожавшая материальные опоры религий, одновременно сохранила памятник архитектуры, – до сих пор вызывает дискуссии среди краеведов и историков.',
      'Судьба имама Мухаммедфатиха Муртазина – одна из самых трагических страниц истории мечети. Он не только руководил приходом, но и издавал первый в Российской империи экономический журнал на татарском языке, вёл переписку с Львом Толстым, состоял в Самарском кредитном банке. В 1932 году его арестовали за сбор средств в пользу сосланных мусульманских духовных лиц и отправили на строительство Беломорско-Балтийского канала. В 1937 году последовал второй арест, а в 1938 году Муртазин был расстрелян. Реабилитирован посмертно.',
      'На долгое время его имя было забыто, и лишь в постсоветский период восстановили исторические ценности объекта.',
      'Архитектурный облик мечети вызывает дискуссии среди искусствоведов. «Мавританский» стиль, в котором выполнены лепнина и мозаика, сочетает исламские орнаменты с элементами «волжского модерна». Эта эклектика отражает уникальный контекст: мечеть строилась в регионе, где мусульманская культура развивалась в тесном взаимодействии с русской и европейской традициями. Одни исследователи считают это свидетельством культурного синтеза, другие – следствием отсутствия собственной архитектурной школы у самарских мусульман конца XIX века.',
    ],
    gallery: [
      gallery1,
      gallery2,
      gallery3,
      gallery4,
      gallery5,
      gallery6,
      gallery7,
      gallery8,
      gallery9,
      gallery10,
      gallery11,
      gallery12,
      gallery13,
      gallery14,
      gallery15,
      gallery16,
      gallery17,
      gallery18,
      gallery19,
      gallery20,
      gallery21,
      gallery22,
      gallery23,
      gallery24,
    ].map((image) => image.src),
  },
};
