import { SightMock } from '@/app/types/sight';
import coverDesktop from './cover_desktop.jpg';
import coverMobile from './cover_mobile.jpg';
import gallery1 from './gallery/1.jpg';
import gallery2 from './gallery/2.jpg';
import gallery3 from './gallery/3.jpg';
import gallery4 from './gallery/4.jpg';
import gallery5 from './gallery/5.jpg';
import gallery6 from './gallery/6.webp';
import gallery7 from './gallery/7.webp';
import gallery8 from './gallery/8.jpg';
import gallery9 from './gallery/9.jpg';
import gallery10 from './gallery/10.jpg';
import gallery11 from './gallery/11.jpg';
import gallery12 from './gallery/12.webp';
import gallery13 from './gallery/13.jpg';
import gallery14 from './gallery/14.jpg';
import gallery15 from './gallery/15.jpg';
import gallery16 from './gallery/16.jpg';
import gallery17 from './gallery/17.jpg';
import gallery18 from './gallery/18.jpg';
import gallery19 from './gallery/19.jpg';

export const mockLeninMuseum: SightMock = {
  id: 'dom-muzei-v-i-lenina',
  description:
    'Здесь 19-летний Ульянов стал Лениным. Купеческая усадьба, где он работал юристом, организовал марксистский кружок и откуда уехал в Петербург, затем изменив ход истории.',
  location: 'Самара',
  card: {
    generalInfo: {
      title: 'Дом-музей В. И. Ленина',
      imageUrl: coverDesktop.src,
      imageUrlMobile: coverMobile.src,
      address: 'Самарская область, г. Самара, ул. Ленинская, 131, 135',
      openingHours: 'ПН-ЧТ, СБ: 9:00 - 17:00. ПТ: 9:00 - 16:45. ВС – выходной',
      phone: '+7 (846) 333-68-58',
      website: 'https://leninmuseum63.ru/',
      price: '150-200 руб./чел. https://leninmuseum63.ru/visit',
    },
    map: {
      lat: 53.192788,
      lng: 50.110537,
    },
    facts: [
      '«Из Симбирска в Самару приехал Ульянов, а уехал - Ленин»<br>Владимир Ильич Ленин (1870–1924 ~54 года) – настоящая фамилия – Ульянов, российский революционер, марксист, создатель Российской социал-демократической рабочей партии (большевиков), главный организатор Октябрьской революции 1917 года в России, основатель первого в мире социалистического государства.',
      'Дата основания музея: 3 января 1940 года.',
      'Основатель и хозяин дома – самарский купец И.А. Рытиков, владелец «Ренскового погреба и лавки сопутствующих колониальных товаров».',
      'Период проживания Ульяновых - с мая 1890 по август 1893 года (&gt;3 лет), где семья снимала квартиру на втором этаже.',
      'Статус объекта – памятник федерального значения, филиал Самарского областного историко-краеведческого музея им. П.В. Алабина.',
      'Адрес: Ул. Ленинская, 131 и 135 (ранее угол улиц Сокольничьей и Почтовой).',
      'Юридическая практика Ленина – в 1892 году поступил на службу в Самарский окружной суд помощником присяжного поверенного А.Н. Хардина. Участвовал в рассмотрении 16 уголовных и 4 гражданских дел.',
      'Реставрация 1986–1989 гг. проведена по проекту московского института «Спецпроектреставрация». Были восстановлены внешний облик дома и планировка квартиры, создан подземный переход между зданиями.',
      'Усадьба сохранилась какой была изначально – жилой дом, каретный сарай и ледник стоят на исторических местах.',
      'Современные экспозиции включают мемориально-бытовую обстановку квартиры Ульяновых на втором этаже (восстановлена к 100-летию Ленина в 1970 г.) и научно-документальную экспозицию на первом.',
      'Экспозиция под открытым небом: «Картины прошлого усадьбы городской...», созданная в 2020 году, воссоздаёт хозяйственно-бытовую среду купеческого двора XIX века.',
    ],
    history: {
      items: [
        'Дом-музей В.И. Ленина расположен в историческом центре Самары, в бывшей усадьбе купца Ильи Рытикова, построенной в последней четверти XIX века. Это двухэтажный деревянный дом с надворными постройками – каретным сараем и ледником (напогребицей), которые сохранились до наших дней в изначальном виде. Семья Ульяновых переехала в Самару в мае 1889 года, а с мая 1890 года снимала весь второй этаж этого дома. Владимиру Ульянову было 19 лет при въезде, а покинул он Самару в 23 года, прожив в городе около 4 лет.',
        'На первом этаже размещалась торговая лавка (вина, чай, кофе, сигары, специи) купца второй гильдии Ильи Рытикова и жилые помещения семьи.',
        'Музейный комплекс занимает два здания (дома 131 и 135), соединённых подземным переходом, что позволило вынести административные службы из мемориального дома и сохранить историческую среду.',
        'На втором этаже воссоздана мемориально-бытовая обстановка квартиры Ульяновых – комнаты всех членов семьи, включая кухню и холодные сени. Обстановка восстанавливалась по чертежам, зарисовкам и описаниям, полученным от родных Ленина.',
        'На первом этаже развёрнута научно-документальная экспозиция «В.И. Ленин в Самаре. 1889–1893 гг.», рассказывающая о юридической практике, марксистском кружке и первых теоретических работах.',
        'С 2016 года в экспозицию включены портретные ростовые фигуры членов семьи Ульяновых.',
        'В 2020 году во дворе создана экспозиция под открытым небом «Картины прошлого усадьбы городской...», воссоздающая быт купеческой усадьбы XIX века с повозками, конской упряжью и сельскохозяйственными орудиями. Экспозиция работает в тёплое время года.',
        'Дом-музей является важным культурным центром, где проводятся экскурсии, лекции и тематические мероприятия.',
      ],
      quote:
        '«Войну надо вести по-настоящему, или ее совсем не вести. Середины тут быть не может.» (с) Владимир Ильич Ленин, Газета «Правда» № 38, 1918 г.',
    },
    legends: [
      '«Владимир Ильич очень любил посещать этот павильон (Жигулёвский пивзавод – прим.), но не ради пива, а, несомненно, ради того многообразного проявления жизни торгово-промышленного города, которое удавалось там наблюдать» - (с) Алексей Беляков, член марксистского кружка Самары, 1893 г.',
      'Считается, что именно в Самаре Владимир Ульянов стал тем самым «Лениным», поскольку это был период становления взрослой личности, начинающего революционера-политика, который организовал марксистский кружок, работал в юридической сфере и позднее сыграл одну из ключевых ролей в трагической трансформации политического строя в России.',
      'Напомним, что по разным оценкам в научной литературе (в некоторой степени спорные подсчёты жертв голода, эпидемий, эмиграции и непосредственно боевых действий) за период от революции до конца гражданской войны (2017-2022 гг.) погибло от 8 до 25 млн человек.',
      'Например, согласно исследованиям доктора исторических наук И.В. Нарского структура указанных потерь:',
      'Голод 1921–1922 гг. ~5–6 млн.',
      'Эпидемии (испанка, тиф и др.) ~3 млн',
      'Боевые действия ~3 млн.',
      'Террор (красный и белый) ~700–750 тыс.',
      'Вполне вероятно, что такой масштаб трагических последствий не мог быть спрогнозирован инициаторами известных событий. Отметим, что В.И. Ленин ушёл из жизни в возрасте 54 лет в 1924 году в результате длительной и мучительной болезни (инсульты, параличи, мигрени).',
      'Научно-документальная экспозиция на первом этаже, развёрнутая к 100-летию Ленина в 1970 году, в 1992 году «утратила свою актуальность и была демонтирована» в связи с изменениями социокультурной ситуации в стране. Это отражает сложный процесс переосмысления советского наследия в постсоветский период. Сегодня музей позиционирует себя не только как мемориальный объект, но и как историко-культурный центр, показывающий повседневный быт купеческой усадьбы XIX века.',
    ],
    gallery: [
      gallery1,
      gallery2,
      gallery3,
      gallery4,
      gallery5,
      gallery6,
      gallery7,
      gallery8,
      gallery9,
      gallery10,
      gallery11,
      gallery12,
      gallery13,
      gallery14,
      gallery15,
      gallery16,
      gallery17,
      gallery18,
      gallery19,
    ].map((image) => image.src),
  },
};
