import { SightMock } from '@/app/types/sight';
import coverDesktop from './cover_desktop.webp';
import coverMobile from './cover_mobile.jpg';
import gallery1 from './gallery/1.jpg';
import gallery2 from './gallery/2.jpg';
import gallery3 from './gallery/3.jpg';
import gallery4 from './gallery/4.jpg';
import gallery5 from './gallery/5.jpg';
import gallery6 from './gallery/6.jpg';
import gallery7 from './gallery/7.jpg';
import gallery8 from './gallery/8.jpg';
import gallery9 from './gallery/9.jpg';
import gallery10 from './gallery/10.jpg';
import gallery11 from './gallery/11.jpg';
import gallery12 from './gallery/12.jpg';
import gallery13 from './gallery/13.jpg';
import gallery14 from './gallery/14.jpg';
import gallery15 from './gallery/15.jpg';
import gallery16 from './gallery/16.jpg';
import gallery17 from './gallery/17.jpg';
import gallery18 from './gallery/18.jpg';
import gallery19 from './gallery/19.jpg';
import gallery20 from './gallery/20.jpg';
import gallery21 from './gallery/21.jpg';
import gallery22 from './gallery/22.jpg';
import gallery23 from './gallery/23.jpg';

export const mockSernoeOzero: SightMock = {
  id: 'sernoe-ozero',
  description:
    'Редкое в мире и в РФ место активного образования самородной серы. Озеро с целебной сероводородной водой и грязью. Памятник природы',
  location: 'Сергиевский район',
  card: {
    generalInfo: {
      title: 'Серное озеро',
      imageUrl: coverDesktop.src,
      imageUrlMobile: coverMobile.src,
      address:
        'Самарская область, Сергиевский район, пос. Серноводск, ул. Советская, 63. (территория Сергиевского медицинского реабилитационного центра ФМБА России)',
      openingHours: 'Круглосуточно, ежедневно (территория санатория и парка доступна для прохода)',
      phone: '+7 (846) 552-18-05',
      website: 'https://www.sergievsk.ru/city/dostoprimechatelynosti/sernoeozero',
      price:
        'Вход на территорию – бесплатный. Экскурсионные туры к озеру – от 1 590 ₽ (взрослые) / от 1 200 ₽ (дети до 12 лет). Дополнительно: посещение курорта «Сергиевские минеральные воды» – 350 ₽ за чел.',
    },
    map: {
      lat: 53.917893,
      lng: 51.252336,
    },
    facts: [
      'Серное озеро – одно из редких мест в мире, где в настоящее время происходит активное образование и отложение самородной серы.',
      'Памятник природы Самарской области.',
      'Площадь водного зеркала – около 1 гектара (как площадь квадрата 100 х 100 м), максимальная глубина – 3 метра.',
      'Озеро питают 6 миллионов литров воды в сутки из четырёх подземных источников, выходящих на поверхность из разлома пермских горных пород.',
      'Вода содержит до 80 мг/л сероводорода и до 1,5 г/л сульфатов (питьевая вода &lt;0,5 г/л), что считается средней концентрацией.',
      'Ежегодно на дно оседает предположительно ~30 тонн чистой самородной серы. Серобактерии в озере окисляют сероводород, выделяя свободную серу.',
      'Лечебная грязь озера – донные отложения, иловая сульфидная (сероводородная) грязь озерно-ключевого типа, в составе которой до 40 элементов таблицы Менделеева – солей, микроэлементов, гуминовых и биологически активных веществ бактерицидного действия.',
      'Среди водорослей озера отмечен редкий вид цианобактерий, возможно эндемичный, однако в научной литературе не описан.',
      'Отсутствие рыбы из-за высокого содержания токсичных серных соединений.',
      'Первое научное описание озера – в 1768 году учёными-исследователями Петром Палласом и Иваном Лепёхиным.',
      'Территория открыта для свободного посещения.',
    ],
    history: {
      items: [
        '«Сии воды суть ключ к здоровью, дарованный землёй» – Готлиб Шобер, лейб-медик Петра I',
        'Серное озеро расположено в посёлке Серноводск Сергиевского района Самарской области, на территории бывшего санатория «Сергиевские минеральные воды» (ныне – Сергиевский медицинский реабилитационный центр ФМБА России). Водоём представляет собой котловину округлой формы, которая питается четырьмя подземными источниками. Вода поступает из древнего размыва горных пород пермского периода палеозойской эры – известняков и доломитов возрастом около 250–300 миллионов лет.',
        'Происхождение озера до сих пор вызывает споры. По неподтверждённым источникам – оно карстового происхождения. По другим, что это пруд, который был вырыт в 1703 году для осаждения серы на месте тростникового болота. Экспедиция 2010 года зафиксировала: «водоём явно искусственный». Локальные краеведы разводят руками: «история образования до конца не ясна – то ли вырытый пруд, то ли природное озеро, искусственно углублённое».',
        'Уникальность озера заключается в том, что здесь происходит естественное сингенетическое биогенное отложение серы, где сероносный ил формируется без гипса и ангидрита – процесс, который в мире встречается лишь в единичных точках.',
        'В воде озера обитают пурпурные и зелёные серобактерии и несколько видов сине-зелёных водорослей. Серобактерии окисляют сероводород до свободной серы. Одновременно сульфатредуцирующие бактерии в донных отложениях восстанавливают сульфаты до сероводорода. Благодаря их деятельности на дно ежегодно оседает около 30 тонн этого химического элемента в чистом виде.',
        'Лечебная грязь озера – донные отложения, иловая сульфидная (сероводородная) грязь озерно-ключевого типа; в её составе комплекс солей, микроэлементов, гуминовых и биологически активных веществ, за счёт которых она обладает комплексно лечебными свойствами – бактерицидными, расслабляющими, улучшающими кровообращение и метаболизм и т.д.',
        'Верхний слой иловых отложений формирует плёнка из серобактерий и водорослей толщиной до 3 см.',
        'Цвет воды в озере непостоянен. В зависимости от освещения и погоды он меняется от изумрудного и бирюзового до бело-серого и сине-зелёного. На поверхности воды образуется белый налёт – плёнка из аморфной серы и серных бактерий, создающая мраморные разводы.',
        'Вода из озера вытекает в виде реки Молочной, которая затем впадает в реку Сургут. В настоящее время лечебная грязь Серного озера не используется для медицинских целей, являясь стратегическим ресурсом для будущего. Основное грязевое месторождение курорта – озеро Молочка, расположенное в 30 километрах от Серноводска. Однако сероводородная вода из источников активно применяется для бальнеологических процедур в виде ванн.',
      ],
      quote: '«…глядетъ на него страшно, и почти не можно долго при нем быть…» (с) Пётр Паллас. 1768 г.',
    },
    legends: [
      '«…Посетители приезжали на курорт, чтобы повеселиться, влюбиться, и, пожалуй, жениться» (с) местная газета 1840-х',
      'Одна из самых интригующих страниц истории озера связана с именем Петра I. В 1703 году по указу царя у озера основали серный завод для производства пороха. Воду из природного водоёма заключили в дубовый «котёл», дно выстлали досками для сбора осаждающейся серы. Работали на заводе шведские пленные, взятые в плен после Полтавской битвы 1709 года, и крепостные крестьяне.',
      'Однако после переноса завода в Жигули (около 1720 года) озеро было заброшено на несколько десятилетий.',
      'В 1808 году произошло событие, которое изменило судьбу озера. Помещик Глазов, страдавший ревматизмом, искупался в местных источниках и почувствовал значительное облегчение. Слава о целебной силе воды разнеслась по всей губернии, и к озеру потянулись больные.',
      'В 1833 году здесь официально открыли курорт «Сергиевские минеральные воды». В XIX веке на водах лечились выдающиеся личности: композитор Пётр Чайковский, писатель Иван Аксаков, математик Николай Лобачевский. Их привлекала не только терапия, но и живописный парк с аллеями, созданный генерал-архитектором Бек-Булатовым. В парке до сих пор растёт 35-метровый тополь, посаженный в 1833 году – ровесник курорта.',
      'Местные жители веками верили в чудодейственную силу озера. Согласно преданию, раненые животные приходили к воде и находили исцеление. Люди переняли эту традицию, и озеро стало местом паломничества задолго до основания официального курорта.',
    ],
    gallery: [
      gallery1,
      gallery2,
      gallery3,
      gallery4,
      gallery5,
      gallery6,
      gallery7,
      gallery8,
      gallery9,
      gallery10,
      gallery11,
      gallery12,
      gallery13,
      gallery14,
      gallery15,
      gallery16,
      gallery17,
      gallery18,
      gallery19,
      gallery20,
      gallery21,
      gallery22,
      gallery23,
    ].map((image) => image.src),
  },
};
