import { SightMock } from '@/app/types/sight';
import coverDesktop from './cover_desktop.jpg';
import coverMobile from './cover_mobile.jpg';
import gallery1 from './gallery/1.webp';
import gallery2 from './gallery/2.jpg';
import gallery3 from './gallery/3.jpg';
import gallery4 from './gallery/4.jpg';
import gallery5 from './gallery/5.webp';
import gallery6 from './gallery/6.webp';
import gallery7 from './gallery/7.jpg';
import gallery8 from './gallery/8.webp';
import gallery9 from './gallery/9.jpg';
import gallery10 from './gallery/10.jpg';
import gallery11 from './gallery/11.webp';
import gallery12 from './gallery/12.webp';
import gallery13 from './gallery/13.jpg';
import gallery14 from './gallery/14.jpg';
import gallery15 from './gallery/15.webp';
import gallery16 from './gallery/16.webp';
import gallery17 from './gallery/17.jpg';
import gallery18 from './gallery/18.jpg';
import gallery19 from './gallery/19.jpg';
import gallery20 from './gallery/20.webp';
import gallery21 from './gallery/21.webp';
import gallery22 from './gallery/22.webp';
import gallery23 from './gallery/23.webp';
import gallery24 from './gallery/24.jpg';
import gallery25 from './gallery/25.jpg';
import gallery26 from './gallery/26.jpg';
import gallery27 from './gallery/27.jpg';
import gallery28 from './gallery/28.jpg';
import gallery29 from './gallery/29.jpg';
import gallery30 from './gallery/30.jpg';
import gallery31 from './gallery/31.jpg';

export const mockBogatyrskayaSloboda: SightMock = {
  id: 'villages-soul',
  description:
    'Деревянная крепость в стиле X–XII веков на берегу Усы (приток Волги), где воспитывают богатырей, строят ладьи и вывели новую породу собак. Живой проект, не только музей.',
  location: 'Ставропольский район',
  card: {
    generalInfo: {
      title: 'Богатырская слобода',
      imageUrl: coverDesktop.src,
      imageUrlMobile: coverMobile.src,
      address: 'Самарская область, Ставропольский район, сельское поселение Жигули',
      openingHours: 'уточняйте предварительно по тел. +7 (927) 616-17-30',
      price: '200 руб/чел. (рекомендуется уточнить по тел.)',
      phone: '+7 (927) 217-11-92',
      website: 'https://богатырскаяслобода.рф/',
    },
    map: {
      lat: 53.336033,
      lng: 49.24636,
    },
    facts: [
      '«Не в силе – правда, а в правде – сила» Девиз проекта<br>Официальное название: «Духовно-культурный кремль "Богатырская слобода" – реконструкция древнерусского града-крепости».',
      'Основатель: Иеромонах Феоктист (в миру — Александр Петров). Идея - с 1985 г., реализация с конца 1990-х.',
      'Первые постройки – 2000 г. Строительство продолжается по настоящее время.',
      'Объект расположен на территории национального парка «Самарская Лука», в 4 км к юго-западу от села Жигули, на правом берегу реки Уса — правого притока Волги.',
      'Территория в зоне Жигулёвских гор с максимальными высотами до 381 м. Рельеф эрозионно-тектонический, с глубокими долинами и карстовыми формами.',
      'Ежегодное обучение до 15–60 воспитанников на базе слободы во Всероссийской школе православной культуры «Русский Богатырь» - круглогодичное учреждение интернатного типа.',
      'Программа обучения включает древнерусские боевые искусства (фехтование мечом, копьём, саблей; безоружный бой), стрельбу из лука, метание топоров и копий, судостроение, гончарное дело, золотошвейное мастерство и кузнечное дело.',
      'Лодейный флот, построенный карельскими мастерами на собственной верфи, эксплуатируются парусно-гребные ладьи «Витязь», «Славяна», «Храбр» (построены в 2010–2011 гг.). В 2011 году экипажи прошли маршрут более 2000 км от острова Кижи (Онежское озеро) до Самарской области (Богатырская слобода).',
      'Выведена новая порода служебных собак — «Святорусский вой» (воеводская). Официально зарегистрирована в 2020 году.',
      'Финансирование проекта – плата за экскурсионное обслуживание, благотворительные пожертвования и гранты. С 2011 года комплекс активно участвует в грантовых конкурсах, в том числе Президентских грантах РФ.',
    ],
    history: {
      items: [
        '«Богатырская слобода» – уникальный для Самарской области антропогенно-природный комплекс, сочетающий функции музея под открытым небом, образовательного центра и православной общины. Инициатором проекта выступил Александр Петров (ныне иеромонах Феоктист), который в 1985 году, будучи студентом художественного училища, сформулировал концепцию возрождения «святорусского богатырства» — социокультурного феномена X–XII веков.',
        'Выбор локации обусловлен историко-культурным контекстом: Самарская Лука – природный регион, где сохранились ландшафты, практически не изменённые антропогенным воздействием. По замыслу основателя, среда должна соответствовать историческому периоду, который реконструируется. Первые постройки появились в 2000 году, и строительство продолжается до сих пор.',
        'Комплекс включает несколько ключевых элементов:',
        'Частокол – оборонительная стена из заострённых брёвен высотой 4–5 метров (тип «стоячий острог»).',
        'Княжий терем – двухэтажное рубленое здание из дуба, в котором размещена музейная экспозиция древнерусского оружия и доспехов. Экспонаты – функциональные реконструкции, используемые в тренировочном процессе.',
        'Сигнальная башня и Калинов мост через овраг Смородиновый.',
        'Комплекс «33 богатыря» – деревянные скульптуры.',
        'Богатырское ристалище – огороженная площадка для тренировок и показательных боёв.',
        'Причал для ладей и трапезная.',
        'Материалы строительства – преимущественно дуб и сосна, обработка производится традиционными плотницкими инструментами. Отопление печное, водоснабжение – колодезное, что соответствует реконструируемой эпохе. На территории также действуют кузница, гончарная и золотошвейная мастерские, конюшня и питомник собак.',
        'Основная функция слободы — образовательная. Здесь действует Всероссийская школа «Русский Богатырь», где воспитанники от 7 до 18 лет изучают древнерусские боевые искусства, судостроение, ремёсла и основы православной культуры. Программа сертифицирована и неоднократно получала государственные гранты.',
        'С 2011 года комплекс активно участвует в грантовых конкурсах, в том числе Президентских грантах Российской Федерации, что позволяет финансировать строительство новых объектов и содержание воспитанников.',
        'Здесь регулярно проводятся фестивали исторической реконструкции, богатырские игры, народные праздники и образовательные программы для детей и молодежи. Важное место занимает физическое и духовное воспитание: посетители могут попробовать свои силы в исконно русских забавах — метании копья, стрельбе из лука, кулачном бою.',
        'Посещение будет полноценным, если выбрать день с мероприятиями на объекте.',
      ],
      quote:
        '«Богатырский бой – это искусство правильных движений в бою. Школа богатырского боя помогает развивать ребят духовно и физически, учит их любить свою родину и ее историю» (с) отец Феоктист',
    },
    legends: [
      '«Это просто богатыри со сталью вместо кожи, каменными мышцами и железными костями.» (с) Григорович Д. В., Рыбаки, 1853',
      'Центральный спор, связанный с «Богатырской слободой», касается трактовки самого понятия «богатырство». В академической науке «богатырство» рассматривается как комплекс воинских, этических и социальных практик древнерусских дружин X–XII веков. Однако основатель проекта интерпретирует его не как исторический феномен, а как действующую систему воспитания, применимую в современных условиях. Это вызывает дискуссии среди историков и педагогов: одни видят в этом ценный опыт патриотического воспитания, другие — вольную трактовку исторического материала.',
      'Сам отец Феоктист рассказывает, что ещё в детстве, будучи мальчишкой, создал макет будущей слободы из пластилина. Эта история, получившая широкое распространение в прессе, символизирует «детскую мечту, ставшую реальностью». Документальных подтверждений существования того самого макета нет, но сам нарратив стал частью «мифологии» проекта.',
      'В отзывах посетителей встречаются полярные мнения. Некоторые отмечают «назойливое туристическое обслуживание», другие – наоборот, отсутствие «показухи» и искренность атмосферы. Критические отзывы упоминают случаи, когда «музей закрыт, праздника нет, ладья простаивает без дела, а внимание уделяется только важным гостям». Эти эпизоды, не имея статуса официальных скандалов, формируют репутационное поле вокруг проекта.',
      'Выведение новой породы собак «Святорусский вой» также вызывает вопросы. Официально порода зарегистрирована в 2020 году и, по данным Euronews, представляет собой помесь немецкой овчарки, волка, хаски, западно-сибирской лайки и белой американо-канадской овчарки. Утверждения о том, что предки этих собак «несли службу в богатырских войсках» и «ходили в бой», не имеют документальных подтверждений и относятся скорее к области исторической реконструкции, чем к кинологии.',
    ],
    gallery: [
      gallery1,
      gallery2,
      gallery3,
      gallery4,
      gallery5,
      gallery6,
      gallery7,
      gallery8,
      gallery9,
      gallery10,
      gallery11,
      gallery12,
      gallery13,
      gallery14,
      gallery15,
      gallery16,
      gallery17,
      gallery18,
      gallery19,
      gallery20,
      gallery21,
      gallery22,
      gallery23,
      gallery24,
      gallery25,
      gallery26,
      gallery27,
      gallery28,
      gallery29,
      gallery30,
      gallery31,
    ].map((image) => image.src),
  },
};
