import { SightMock } from '@/app/types/sight';
import coverDesktop from './cover_desktop.jpg';
import coverMobile from './cover_mobile.jpg';
import gallery1 from './gallery/1.jpg';
import gallery2 from './gallery/2.jpg';
import gallery3 from './gallery/3.jpg';
import gallery4 from './gallery/4.jpg';
import gallery5 from './gallery/5.jpg';
import gallery6 from './gallery/6.jpg';
import gallery7 from './gallery/7.jpg';
import gallery8 from './gallery/8.jpg';
import gallery9 from './gallery/9.jpg';
import gallery10 from './gallery/10.jpg';
import gallery11 from './gallery/11.jpg';
import gallery12 from './gallery/12.jpg';
import gallery13 from './gallery/13.jpg';
import gallery14 from './gallery/14.jpg';
import gallery15 from './gallery/15.jpg';
import gallery16 from './gallery/16.jpg';
import gallery17 from './gallery/17.jpg';
import gallery18 from './gallery/18.jpg';
import gallery19 from './gallery/19.jpg';
import gallery20 from './gallery/20.jpg';
import gallery21 from './gallery/21.jpg';

export const mockGoluboeOzero: SightMock = {
  id: 'goluboe-ozero',
  description:
    'Карстовое озеро-воронка с изумрудно-голубой сероводородной водой, не замерзающая зимой. В 2013 году дно провалилось, открыв тоннель. Глубина – до 28 метров, диаметр – 42 метра.',
  location: 'Сергиевский район',
  card: {
    generalInfo: {
      title: 'Голубое озеро',
      imageUrl: coverDesktop.src,
      imageUrlMobile: coverMobile.src,
      address:
        'Самарская область, Сергиевский район, окрестности села Старое Якушкино (в 3 км от села, в 130 км от Самары)',
      openingHours: 'Круглосуточно, ежедневно.',
      phone: '+7 (846) 552-18-05',
      website: 'https://www.sergievsk.ru/city/dostoprimechatelynosti/goluboe',
      price: 'Вход на территорию – бесплатно',
    },
    map: {
      lat: 53.912215,
      lng: 51.487645,
    },
    facts: [
      'Карстовое происхождение озера – в результате вымывания мягких гипсовых слоёв почвы подземными водами. Точная дата возникновения неизвестна.',
      'Размеры озера: диаметр – 42 м., площадь поверхности ~1086 м², глубина от 20 до 28 метров, имеет почти круглую форму.',
      'Стены карстовой воронки с уклоном 70–90°, сужаясь книзу. В апреле 2013 года произошёл провал дна, увеличивший глубину ещё на 10 метров.',
      'Подводный тоннель открылся после провала 2013 г., тоннель неизученной протяжённости, названный «Апрельским ходом». Самарские водолазы погружались в него до глубины 34 метра.',
      'Температура воды стабильна круглый год: у поверхности – до +8,8 °С, у дна – около +6,8 °С. Озеро не замерзает даже в сильные морозы благодаря постоянному притоку тёплых подземных вод.',
      'Вода в озере полностью обновляется за сутки – 6200 кубических метров за 24 часа согласно исследованиям – это чрезвычайно высокая скорость расхода воды для водоёма такого типа.',
      'Вода насыщена сероводородом, что придаёт ей характерный запах тухлых яиц и изумрудно-голубой цвет. Преобладают сульфаты и кальций.',
      'Первые научные описания озера – в 1762 году Петром Рычковым, в 1768 году – Иваном Лепёхиным и Петром Палласом. В 1848 году озеро описал писатель Иван Аксаков.',
      'Озеро – памятник природы регионального значения и охраняется государством. Въезд и стоянка транспорта вне дорог, разведение костров запрещены.',
    ],
    history: {
      items: [
        'Голубое озеро расположено в Сергиевском районе Самарской области, в 3 километрах от села Старое Якушкино и в 130 километрах от Самары. Оно представляет собой классическую карстовую воронку – форму рельефа, образующуюся при выщелачивании растворимых горных пород (в данном случае – гипсов) подземными водами. Озеро получило своё название за интенсивную изумрудно-голубую окраску воды.',
        'Интерес учёных к этому объекту – с в XVIII века. В 1762 году озеро исследовал Пётр Иванович Рычков - известный географ-краевед, член-корреспондент Петербургской академии наук. В 1768 году, в рамках академических экспедиций, сюда прибыли Иван Иванович Лепёхин и Пётр Симон Паллас - одни из крупнейших естествоиспытателей Российской империи. Именно тогда появились первые подробные научные описания. Настоящую известность озеру принёс писатель Иван Сергеевич Аксаков. В июне 1848 года, находясь на лечении на Серноводских минеральных водах, он написал «Письма с серных вод к родителям», где назвал озеро частью «степной роскоши».',
        'Геологическое строение озера уникально. Мягкие гипсовые слои почвы, которыми богат Сергиевский район, веками вымывались водой, что привело к образованию глубокой воронки. Процесс продолжается до сих пор – озеро постепенно расширяется. Считается, что Голубое озеро и соседние водоёмы питаются от одного источника – подземной реки, что объясняет одинаковый химический состав воды.',
        'Ещё одна особенность озера – почти полное отсутствие в нём жизни из-за химического состава. В озере нет рыбы, зато есть кольчатые черви и моллюски. На поверхности встречаются насекомые – водяные скорпионы, водомерки и водолюбы. Озеро привлекает туристов не только редкой красотой, но и возможностью заняться экстремальным дайвингом. Желающим искупаться надо помнить, что вода здесь всегда очень холодная, а берег отвесный.',
        'В 2013 году произошло знаковое событие: дно озера провалилось, открыв вход в подводный тоннель. Самарские водолазы-исследователи погружались в него до глубины 34 метра, однако полная протяжённость тоннеля остаётся неизученной. Зимой 2014 года произошёл обвал подводных стенок, и вход в тоннель был засыпан. К 2018 году глубина озера уменьшилась до 22 метров.',
      ],
      quote:
        '«Что за красота!.. Оно голубо от преломления лучей в этой светлой серной воде. Озеро или озерко – глубоко, говорят, до двадцати сажен и идёт вниз воронкой... Но ещё краше сама степь, и горы, и ковыль! Что за роскошь!..» – Иван Сергеевич Аксаков, писатель и славянофил, 1848 г.',
    },
    legends: [
      '«Измерить глубину голубого озера вожжами пытался монгольский хан, но дна они так и не достигли». «АиФ-Самара», о легендах озера.',
      '«В соответствии с положением о памятнике природы регионального значения „Голубое озеро“ запрещается любая деятельность, влекущая за собой нарушение сохранности уникальной экосистемы» (с) Министерство природных ресурсов Самарской области.',
      'Долгое время среди местного населения ходило поверье, что Голубое озеро бездонно. Согласно преданию, один из татарских или ногайских ханов, завоевавших эти земли, попытался измерить глубину озера. Однако сколько бы верёвки он ни спускал – дна достичь не удалось. Этот миф имеет рациональное объяснение: карстовые воронки действительно могут уходить на десятки и даже сотни метров вглубь. На момент формирования легенды технические возможности не позволяли измерить реальную глубину.',
      'Голубое озеро считалось практически священным местом. Здесь проводили национальные праздники, собирались жители окрестных деревень. Существовало неписаное правило: плохим тоном считалось не только распивать алкоголь на берегу, но даже появляться здесь в нетрезвом виде. Эта традиция сохранялась десятилетиями.',
      'После провала дна в 2013 году открылся вход в подводный тоннель. Водолазы, погружавшиеся в него, сообщают, что тоннель имеет достаточно большое сечение – человек может проплыть по нему. Однако полная протяжённость и направление тоннеля неизвестны. Существует гипотеза, что он соединяет Голубое озеро с другими карстовыми полостями в Сергиевском районе, возможно – с системой подземных рек, питающих Сергиевские минеральные источники.',
      'В народе бытовало поверье, что вода Голубого озера обладает целебными свойствами – якобы она помогает при кожных заболеваниях благодаря высокому содержанию сероводорода. Однако научных подтверждений этому нет. Более того, врачи не рекомендуют пить эту воду из-за высокого содержания сульфатов и сероводорода.',
      'В 2026 году прокуратура заинтересовалась рекламой дайвинга и айсфлоатинга на Голубом озере. Фирма, предлагавшая такие туры, получила предостережение, так как озеро является особо охраняемой природной территорией, и любая деятельность, нарушающая сохранность экосистемы, запрещена. Действительно, бывает сложно найти баланс между использованием объекта для туризма и его охраной.',
    ],
    gallery: [
      gallery1,
      gallery2,
      gallery3,
      gallery4,
      gallery5,
      gallery6,
      gallery7,
      gallery8,
      gallery9,
      gallery10,
      gallery11,
      gallery12,
      gallery13,
      gallery14,
      gallery15,
      gallery16,
      gallery17,
      gallery18,
      gallery19,
      gallery20,
      gallery21,
    ].map((image) => image.src),
  },
};
