import { SightMock } from '@/app/types/sight';
import coverDesktop from './cover_desktop.jpg';
import coverMobile from './cover_mobile.jpg';
import gallery1 from './gallery/1.jpg';
import gallery2 from './gallery/2.jpg';
import gallery3 from './gallery/3.jpg';
import gallery4 from './gallery/4.jpg';
import gallery5 from './gallery/5.jpg';
import gallery6 from './gallery/6.webp';
import gallery7 from './gallery/7.jpg';
import gallery8 from './gallery/8.jpg';
import gallery9 from './gallery/9.jpg';
import gallery10 from './gallery/10.jpg';
import gallery11 from './gallery/11.jpg';
import gallery12 from './gallery/12.webp';
import gallery13 from './gallery/13.jpg';
import gallery14 from './gallery/14.jpg';
import gallery15 from './gallery/15.jpg';
import gallery16 from './gallery/16.jpg';
import gallery17 from './gallery/17.jpg';
import gallery18 from './gallery/18.jpg';
import gallery19 from './gallery/19.jpg';

export const mockVoznesenskiiMuzhskoiMonastyr: SightMock = {
  id: 'voznesenskii-muzhskoi-monastyr',
  description:
    'Старейший монастырь Сызрани, (1685 г.). Место, где хранилась чудотворная Феодоровская икона Божией Матери. Ныне хранится 5 святынь. Островок тишины и молитвы среди городской суеты.',
  location: 'Сызрань',
  card: {
    generalInfo: {
      title: 'Вознесенский мужской монастырь',
      imageUrl: coverDesktop.src,
      imageUrlMobile: coverMobile.src,
      address: 'Самарская область, Сызрань, Монастырская ул., 2',
      openingHours: 'с 7.00 до 19.00 ежедневно',
      phone: '+7 (846) 436-10-60',
      website: 'https://vozmonsyz.ru/',
      price: 'Бесплатно',
    },
    map: {
      lat: 53.147464,
      lng: 48.43766,
    },
    facts: [
      'Основан по указу царей в 1685 г. по челобитной старца Кирилла – на имя царей Ивана V и Петра I.',
      'Старейший на территории современной Самарской области – по одной из исторических версий, всего на два года моложе города-крепости Сызрань.',
      'Первая каменная церковь, построенная в 1738–1739 годах на месте деревянного храма отставным дворянином Иваном Борисовым, исцелившимся по молитве перед иконой.',
      'Главная святыня – Феодоровская чудотворная икона Божией Матери, явленная в 1713 году у родника в селе Кашпир. Икона хранилась в монастыре до середины XX века. (с тех пор в Казанском соборе Сызрани).',
      'В период расцвета в 1852 году построен Вознесенский собор – величественный пятикупольный, а монастырь получил статус первоклассного – высший статус для того времени, всё это при архимандрите Августине Шеленговском.',
      'В годы гонений в 1923 году монастырь был закрыт, его последний настоятель архимандрит Александр (Вахатов) в 1938 году расстрелян.',
      'Ныне в обители пять святынь, включая иконы с частицами мощей. Монашеская жизнь возобновлена в 1996 году.',
    ],
    history: {
      items: [
        'Вознесенский мужской монастырь в Сызрани – древнейшая обитель Самарской земли, основанная в 1685 году. Её история началась с челобитной старца Кирилла, который просил царей Ивана V и Петра I разрешить построить монастырь для отставных солдат Сызранского гарнизона. Многие из них, отслужив 25 лет, желали принять постриг, но умирали без покаяния – так родилась эта святая обитель.',
        'Главная святыня монастыря – Феодоровская икона Божией Матери, явленная в 1713 году у родника в селе Кашпир. По преданию, местные пастухи увидели у источника сияющий образ. Вскоре икона прославилась чудесами: отставной дворянин Иван Борисов, страдавший болезнью глаз, после усердной молитвы перед ней полностью исцелился. В благодарность он построил первый каменный храм обители. В чудотворность иконы по сей день верят множество верующих, а также чудотворным считают родник у села Кашпир, где нашли икону.',
        'Ныне действующие святыни:<br>икона великомученицы Варвары с частицей мощей<br>ковчежец с частицами мощей преподобных Антония Великого<br>Пахомия Великого<br>святителя Павла I Константинопольского<br>икона преподобного Серафима Саровского',
        'Монастырь пережил взлёты и падения: секуляризацию при Екатерине II, когда лишился земель, расцвет в XIX веке при архимандрите Августине, когда стал первоклассным, и годы гонений в XX веке. В 1923 году обитель закрыли, а её настоятеля расстреляли. Но стены устояли. В 1996 году монашеская жизнь возродилась. Сегодня это действующий мужской монастырь – место тишины и молитвы, где каждый может прикоснуться к святыням.',
      ],
      quote: '«Наша жизнь – одна минута в сравнении с вечностью» (с) Преподобный Серафим Саровский',
    },
    gallery: [
      gallery1,
      gallery2,
      gallery3,
      gallery4,
      gallery5,
      gallery6,
      gallery7,
      gallery8,
      gallery9,
      gallery10,
      gallery11,
      gallery12,
      gallery13,
      gallery14,
      gallery15,
      gallery16,
      gallery17,
      gallery18,
      gallery19,
    ].map((image) => image.src),
  },
};
