import { SightMock } from '@/app/types/sight';
import coverDesktop from './cover_desktop.jpg';
import coverMobile from './cover_mobile.jpg';
import gallery1 from './gallery/1.jpg';
import gallery2 from './gallery/2.webp';
import gallery3 from './gallery/3.jpg';
import gallery4 from './gallery/4.webp';
import gallery5 from './gallery/5.jpg';
import gallery6 from './gallery/6.jpg';
import gallery7 from './gallery/7.jpg';
import gallery8 from './gallery/8.jpg';
import gallery9 from './gallery/9.webp';
import gallery10 from './gallery/10.jpg';
import gallery11 from './gallery/11.jpg';
import gallery12 from './gallery/12.jpg';
import gallery13 from './gallery/13.jpg';
import gallery14 from './gallery/14.jpg';
import gallery15 from './gallery/15.webp';
import gallery16 from './gallery/16.jpg';
import gallery17 from './gallery/17.jpg';
import gallery18 from './gallery/18.jpg';
import gallery19 from './gallery/19.jpg';
import gallery20 from './gallery/20.jpg';
import gallery21 from './gallery/21.jpg';
import gallery22 from './gallery/22.jpg';

export const mockMolodetskiiKurgan: SightMock = {
  id: 'molodetskii-kurgan',
  description:
    'Начало 75-километровой гряды Жигулей высотой 243 м. По легенде здесь Степан Разин прятал клад, а сегодня – около 200 редких растений и лучший вид на Волгу.',
  location: 'Ставропольский район',
  card: {
    generalInfo: {
      title: 'Молодецкий курган',
      imageUrl: coverDesktop.src,
      imageUrlMobile: coverMobile.src,
      address: 'Самарская область, Ставропольский район, ул. Молодецкий Курган',
      openingHours: 'круглосуточно, ежедневно',
      phone: '+7 (927) 899-76-56',
      website: 'https://npsamluka.ru/dostoprimechatelnosti/molodecky-kurgan/?ysclid=muig39brg4521232298',
      price:
        '244 руб/чел. (рекомендуется уточнять по тел. или на сайте https://npsamluka.ru/services/preiskurant-cen/?ysclid=muh5naq1pu572122735)',
    },
    map: {
      lat: 53.406472,
      lng: 49.310925,
    },
    facts: [
      'Находится у слияния рек Уса и Волга, на северо-западе Самарской Луки, напротив Тольятти. С кургана начинается 75-километровая гряда Жигулёвских гор.',
      '242,8 метра над уровнем моря, это одна из высших точек Самарской области.',
      'Кургану более 7 млн лет и он сложен осадочными породами палеозойского возраста – известняками и доломитами, подверженными карстовым процессам.',
      'Статус особо охраняемой природной территории в составе национального парка «Самарская Лука».',
      'Более 200 видов редких и исчезающих растений. Среди них — тонконог жестколистный, ковыль перистый, тимьян жигулёвский, молочай жигулёвский.',
      'В окрестностях обитают орлан-белохвост, дыбка степная, бабочки аполлон и махаон.',
      'Экологическая тропа протяжённостью 5,7 км с двумя вариантами — восхождение на вершину кургана (для подготовленных) или на Девью гору (упрощённый).',
      'Захаровский слёт – ежегодный туристический фестиваль, ведущий историю с 1963 года, проводится во вторые выходные июня у подножия кургана.',
    ],
    history: {
      items: [
        '«Хребет известковых гор, как здешней берег, так и превысокую часть гористого берега Волги составляющих, начинается насупротив Ставрополя при устье реки Усы. На сих горах везде находится лес, и вершины их обыкновенно покрыты соснами. С речной стороны видны у оных гор одни только голыя каменныя стены, и множество разщелявшихся разных камней, представляющих приятный вид зрению. На сих каменистых берегах находится несказанное множество хищных птиц, которыя летом вьют там гнезда, а особливо беловатых орлов, или, по-тамошнему названию, белохвостов, и замою их очень много. В густом лесу на горах часто бывают бурые и черные медведи, а иногда и рыси». (с) Пётр Паллас, исследователь-профессор, заметки о Жигулевских горах, 1769 г.',
        'Молодецкий курган – один из самых посещаемых памятников природы в Самарской области высотой около 243 метра. Его история овеяна легендами, от названия, связываемого с обороной от врагов, до рассказов о Стеньке Разине.',
        'Курган представляет собой останцовую возвышенность, сложенную пермскими отложениями – известняками и доломитами (&gt;250 млн.лет), которые подверглись карстовым процессам. Отвесные скалы и уступы придают ему суровый облик, а на тонком слое щебневой почвы сохраняется редкое сообщество каменистой степи. Один из склонов покрыт густым лиственным лесом, а на вершине растут реликтовые сосны.',
        'Объект является частью национального парка «Самарская Лука» — территории с уникальным сочетанием флоры и фауны. Здесь зафиксировано более 200 видов редких и исчезающих растений, включая эндемичные виды – тимьян жигулёвский и молочай жигулёвский. Из животных встречаются орлан-белохвост, дыбка степная, а также редкие бабочки — аполлон и махаон.',
        'Туристический объект оборудован двумя экологическими тропами, местами для отдыха, парковкой, пикниковой поляной и площадкой для установки палаток на берегу волжского залива. Основной маршрут «К вершине Молодецкого кургана» протяжённостью 5,7 км рассчитан на 4 часа и предполагает два варианта: восхождение на вершину кургана для более подготовленных посетителей или на Девью гору — более простой путь.',
        'Девья гора – невысокая вершина (около 50 м) у подножия кургана, обрывающаяся отвесной скалой в воды Жигулёвского моря. С неё открывается вид на Тольятти и Автозаводский район.',
        'Интерес к кургану издавна проявляли учёные и путешественники. Здесь бывали голландский путешественник Ян Стрейс (1669), естествоиспытатели Пётр Паллас и Иван Лепёхин (1769). В настоящее время объект остаётся площадкой для экологического просвещения: на территории проводятся волонтёрские акции по благоустройству и сохранению биоразнообразия.',
      ],
      quote: '«Молодецкий курган: легенда, отлитая в камне»',
    },
    legends: [
      '«На речке Усолке были найдены соленые ключи и залежи глауберовой соли, в Жигулях — залежи железной руды, негодной к плавке, в Яблочных горах — алебастр, гипс, самородная желтая и янтарного цвета сера, твердая горная смола, употребляемая для чернения железа» Иван Лепёхин, исследователь-академик, план работы экспедиции, 1769 г.',
      'Самая устойчивая легенда, связанная с Молодецким курганом, касается клада Степана Разина. Согласно преданию, атаман зарыл здесь два ведра золота, положив поперёк них заговорённый лом, чтобы никто не мог найти сокровище. Кладоискатели пытаются обнаружить его на протяжении трёхсот лет, но безуспешно. По другой версии, раненый Разин зарыл на кургане свою золотую трубку. Считается также, что утёс Стеньки Разина, о котором поётся в песне «Есть на Волге утёс», — это именно Молодецкий курган.',
      'Названия кургана и соседней Девьей горы связывают с трагической легендой о любви. Добрый молодец Иван полюбил Груню, дочь богатого купца из села Усолье. Отец девушки был против свадьбы, и Иван ушёл к Степану Разину, где за подвиги получил фамилию Молодцов. Груня сбежала к нему, но отец привёл царские войска. Разинцы были разбиты. Иван поднялся на курган, простился с Груней и бросился в Волгу. Увидев это, девушка взбежала на соседнюю горку и тоже бросилась с обрыва. С тех пор курган называют Молодецким, а холм — Девьей горой.',
      'Более вероятной версией происхождения топонима считается связь с местом сбора «беглых добрых молодцов» – беглых крестьян и разбойников, укрывавшихся в Жигулёвских горах от властей. Самарская Лука была труднодоступной территорией, способной укрыть множество людей, и казачество здесь постоянно пополнялось за счёт скрывавшихся крестьян.',
      'Отдельный пласт легенд связан с названием «Девьи горы», которое исторически применялось ко всей западной части Жигулёвских гор. На одной из старинных карт эта территория обозначена как «Амазония». Это породило миф о том, что здесь могли жить воинственные амазонки — сюжет, будораживший ещё древних греков. Документальных подтверждений этому нет, но топоним «Девьи горы» действительно зафиксирован в исторических источниках.',
      'Легенда о княжне, брошенной Разиным в Волгу, также связывается с Молодецким курганом. Считается, что свидетелем этой истории был голландский путешественник Ян Стрейс, отразивший её в своих записках. Однако историки относятся к этим свидетельствам с осторожностью – они не имеют независимого подтверждения.',
    ],
    gallery: [
      gallery1,
      gallery2,
      gallery3,
      gallery4,
      gallery5,
      gallery6,
      gallery7,
      gallery8,
      gallery9,
      gallery10,
      gallery11,
      gallery12,
      gallery13,
      gallery14,
      gallery15,
      gallery16,
      gallery17,
      gallery18,
      gallery19,
      gallery20,
      gallery21,
      gallery22,
    ].map((image) => image.src),
  },
};
