import { SightMock } from '@/app/types/sight';
import coverDesktop from './cover_desktop.jpg';
import coverMobile from './cover_mobile.webp';
import gallery1 from './gallery/1.jpg';
import gallery2 from './gallery/2.jpg';
import gallery3 from './gallery/3.jpg';
import gallery4 from './gallery/4.webp';
import gallery5 from './gallery/5.jpg';
import gallery6 from './gallery/6.jpg';
import gallery7 from './gallery/7.jpg';
import gallery8 from './gallery/8.jpg';
import gallery9 from './gallery/9.jpg';
import gallery10 from './gallery/10.jpg';
import gallery11 from './gallery/11.jpg';
import gallery12 from './gallery/12.jpg';
import gallery13 from './gallery/13.jpg';
import gallery14 from './gallery/14.jpg';
import gallery15 from './gallery/15.jpg';
import gallery16 from './gallery/16.jpg';
import gallery17 from './gallery/17.jpg';
import gallery18 from './gallery/18.jpg';
import gallery19 from './gallery/19.jpg';
import gallery20 from './gallery/20.jpg';
import gallery21 from './gallery/21.jpg';
import gallery22 from './gallery/22.jpg';
import gallery23 from './gallery/23.jpg';
import gallery24 from './gallery/24.jpg';
import gallery25 from './gallery/25.jpg';
import gallery26 from './gallery/26.jpg';
import gallery27 from './gallery/27.jpg';
import gallery28 from './gallery/28.jpg';
import gallery29 from './gallery/29.webp';
import gallery30 from './gallery/30.jpg';
import gallery31 from './gallery/31.jpg';
import gallery32 from './gallery/32.jpg';
import gallery33 from './gallery/33.jpg';

export const mockTatischeva: SightMock = {
  id: 'pamyatnik-vasiliyu-tatishchevu',
  description:
    'Конный памятник В.Н. Татищеву – основателю г. Ставрополь-на-Волге (ныне Тольятти) на 14-метровом постаменте. Главный символ города, точка притяжения свадеб и свиданий.',
  location: 'Тольятти',
  card: {
    generalInfo: {
      title: 'Памятник Василию Татищеву',
      imageUrl: coverDesktop.src,
      imageUrlMobile: coverMobile.src,
      address: 'Самарская область, Тольятти, микрорайон Портовый',
      openingHours: 'Круглосуточно',
      price: 'Бесплатно',
    },
    map: {
      lat: 53.474482,
      lng: 49.348334,
    },
    facts: [
      'Дата открытия: 2 сентября 1998 года. На торжественной церемонии присутствовали прямые потомки В. Н. Татищева, приехавшие из Франции.',
      'Скульптор и архитектор: Автор — народный художник РФ Александр Рукавишников, архитектор — А. Кочековский.',
      'Размеры и материал: Бронзовая скульптура имеет высоту 7,5 метра, а известняковый постамент — 14 метров, общая высота более 21 метра (высота 7 этажного дома). Ранее в СМИ ее называли самой высокой конной статуей в Европе.',
      'Финансирование и стоимость: Создан на средства фонда «Духовное наследие» и пожертвования горожан. Общая стоимость монумента — почти 15 миллионов рублей (~2,5 млн.$ в ценах 1998 г.).',
      'Местоположение: Берег Куйбышевского водохранилища в Портпоселке. Скульптор выбрал это место из-за живописного фона – старинных зданий в Тольятти нет, а основанный Татищевым Ставрополь остался под водой.',
      'Стилобат-крепость: Основание в виде фрагментов каменной кладки и многоугольных башен. Стилобат внешне стилизован под фрагменты крепостных стен и башен петровской эпохи. Служил смотровой площадкой.',
      'Символ города: Изображение этого памятника чаще всего используется в качестве визуального символа города. Его можно встретить на официальных буклетах, этикетках, проездных билетах и сувенирной продукции.',
      'Охранный статус: С 1999 года официально признан памятником монументального искусства и охраняется государством.',
    ],
    history: {
      items: [
        'Памятник Василию Никитичу Татищеву — основателю города Ставрополь-на-Волге (ныне Тольятти) — это главный исторический символ города. Памятник заказан в 1996 году к празднованию 250-летия основания города (1737 г.) и установлен в сентябре 1998 года. Примечательно, что изначально В.Н. Татищев поселение назвал Епифания (с греч. – просвещение или просветление «момент внезапного прозрения или осознания, когда человеку открывается глубокая истина или понимание сути чего-либо»). Однако же через два года после отзыва основателя в Санкт-Петербург в 1739 году, это место получило имя: Ставрополь-на-Волге.',
        'Летом 1996 года многие были удивлены решением скульптора Александра Рукавишникова разместить статую не в центре города, а на берегу Волги на примерно одинаковом расстоянии от 3-х районов города. Но ему удалось отстоять свою точку зрения.',
        'К июлю 1997 года Рукавишников закончил модель в глине. Отливка велась в Польше и Белоруссии, а сложные детали отливали в Чехии. Затем контрольная сборка и испытания в Минске, после чего в разобранном состоянии был доставлен в Тольятти и установлен на берегу Волги.',
        'Для кладки постамента использовались известняковые плиты из ближайшего карьера Ширяево.',
        'Памятник построен на средства фонда «Духовное наследие», пожертвования организаций и горожан. Общая стоимость памятника и благоустройства территории составила почти 15 миллионов рублей (~2,5 млн.$ на тот период).',
        'Василий Татищев изображён в полный рост, в историческом костюме XVIII века. Его взгляд направлен в сторону центрального района города, который был построен в период строительства Куйбышевской ГЭС (ныне – Жигулёвская), а по ходу коня находится ушедший под воду город – непосредственно Ставрополь-на-Волге, который был обречён на затопление после запуска ГЭС.',
        'На гранитном постаменте высечена надпись с именем Татищева и годами жизни (1686–1750 ~64 года).',
        'У подножия памятника открывается живописный вид на широкое Куйбышевское водохранилище и Жигулёвские горы.',
        'Скульптор передал не только портретное сходство, но и черты характера Татищева — упорство и непреклонность в достижении цели, мудрость и государственное мышление. Интересно, что в других городах, основанных Василием Никитичем, установлены памятники в его честь примерно в те же периоды – в Екатеринбурге в августе 1998 года (к 275-летию города: основан в 1723 г.), в Перми – в июне 2003 года (к 280-летию: основан в 1723 г.).',
        '«России, как стране обширной, более всего соответствует монархическое управление» В.Н. Татищев',
      ],
      quote:
        '«Умопросвещение — вот чего он желал своему народу, но основанного не на рабском подражании Западу, а на его действительных потребностях и нуждах» Василий Ключевский, русский историк XIX – XX вв.',
    },
    legends: [
      'Жест, породивший споры<br>Одна из самых обсуждаемых загадочных деталей композиции — жест самого Татищева. Изначально, по замыслу архитекторов, основатель должен был указывать рукой на исторический центр — на территорию ушедшего под воду Ставрополя. Это было бы символичным жестом в сторону утраченного прошлого. Однако в процессе работы скульптор Александр Рукавишников принял решение: на нейтральный жест в сторону современного Тольятти.',
      'Другая легенда, романтизирующая образ Татищева, гласит, что в одном из боев Северной войны молодой поручик заслонил собой от пули самого Петра Первого. Этот миф, не имеющий строгих документальных подтверждений, кочует по путеводителям как пример личной преданности основателя города императору.',
      'Памятник неоднократно становился объектом атак вандалов, что превратилось в отдельную социальную проблему. В 2017 году постамент, ставший излюбленным местом для прогулок, покрылся «высоко интеллектуальными» граффити и стало принято отковыривать плитку с постамента и уносить её в неизвестном направлении.',
      'В итоге к доступ обзорной площадке у подножия постамента пришлось закрыть черной калиткой с кольцом-замком, что до сих пор вызывает досаду у посетителей, но мера, похоже, ещё долго останется необходимостью для сохранения символа города, несмотря на возмущения людей культурным уровнем «дикарей-неадекватов», которые лишили всех возможности подходить к монументу вплотную и наслаждаться видами с обзорной площадки.',
    ],
    videoTours: ['https://rutube.ru/video/756a86d75816b1da427886a10a22ae86/?r=plwd'],
    audioGuides: [
      'https://disk.yandex.ru/d/h-vRsUEet3hhDQ/%D0%9A%D0%9E%D0%9D%D0%A2%D0%95%D0%9D%D0%A2/2.%20%D0%9F%D0%B0%D0%BC%D1%8F%D1%82%D0%BD%D0%B8%D0%BA%20%D0%92%D0%B0%D1%81%D0%B8%D0%BB%D0%B8%D1%8E%20%D0%A2%D0%B0%D1%82%D0%B8%D1%89%D0%B5%D0%B2%D1%83.%20%D0%A2%D0%BE%D0%BB%D1%8C%D1%8F%D1%82%D1%82%D0%B8/%D0%90%D0%A3%D0%94%D0%98%D0%9E/%D0%A2%D0%B0%D1%82%D0%B8%D1%89%D0%B5%D0%B2%20%D0%90%D1%83%D0%B4%D0%B8%D0%BE%D0%B3%D0%B8%D0%B4%201.MP3',
      'https://disk.yandex.ru/d/h-vRsUEet3hhDQ/%D0%9A%D0%9E%D0%9D%D0%A2%D0%95%D0%9D%D0%A2/2.%20%D0%9F%D0%B0%D0%BC%D1%8F%D1%82%D0%BD%D0%B8%D0%BA%20%D0%92%D0%B0%D1%81%D0%B8%D0%BB%D0%B8%D1%8E%20%D0%A2%D0%B0%D1%82%D0%B8%D1%89%D0%B5%D0%B2%D1%83.%20%D0%A2%D0%BE%D0%BB%D1%8C%D1%8F%D1%82%D1%82%D0%B8/%D0%90%D0%A3%D0%94%D0%98%D0%9E/%D0%A2%D0%B0%D1%82%D0%B8%D1%89%D0%B5%D0%B2%20%D0%90%D1%83%D0%B4%D0%B8%D0%BE%D0%B3%D0%B8%D0%B42.MP3',
    ],
    gallery: [
      gallery1,
      gallery2,
      gallery3,
      gallery4,
      gallery5,
      gallery6,
      gallery7,
      gallery8,
      gallery9,
      gallery10,
      gallery11,
      gallery12,
      gallery13,
      gallery14,
      gallery15,
      gallery16,
      gallery17,
      gallery18,
      gallery19,
      gallery20,
      gallery21,
      gallery22,
      gallery23,
      gallery24,
      gallery25,
      gallery26,
      gallery27,
      gallery28,
      gallery29,
      gallery30,
      gallery31,
      gallery32,
      gallery33,
    ].map((image) => image.src),
  },
};
