import { SightMock } from '@/app/types/sight';
import coverDesktop from './cover_desktop.jpg';
import coverMobile from './cover_mobile.jpg';
import gallery1 from './gallery/1.jpg';
import gallery2 from './gallery/2.jpg';
import gallery3 from './gallery/3.jpg';
import gallery4 from './gallery/4.jpg';
import gallery5 from './gallery/5.jpg';
import gallery6 from './gallery/6.jpg';
import gallery7 from './gallery/7.jpg';
import gallery8 from './gallery/8.jpg';
import gallery9 from './gallery/9.jpg';
import gallery10 from './gallery/10.jpg';
import gallery11 from './gallery/11.jpg';
import gallery12 from './gallery/12.jpg';
import gallery13 from './gallery/13.jpg';
import gallery14 from './gallery/14.jpg';
import gallery15 from './gallery/15.jpg';
import gallery16 from './gallery/16.jpg';
import gallery17 from './gallery/17.jpg';
import gallery18 from './gallery/18.webp';
import gallery19 from './gallery/19.webp';
import gallery20 from './gallery/20.jpg';
import gallery21 from './gallery/21.webp';

export const mockPredannosti: SightMock = {
  id: 'pamyatnik-predannosti',
  description:
    'Бронзовая скульптура немецкой овчарки, ставшей легендой и символом бесконечной преданности. Пёс 7 лет ждал погибших хозяев на обочине дороги, превратившись в легенду города.',
  location: 'Тольятти',
  card: {
    generalInfo: {
      title: 'Памятник преданности',
      imageUrl: coverDesktop.src,
      imageUrlMobile: coverMobile.src,
      address:
        'Самарская область, г. Тольятти, Автозаводский район, 21-й квартал, пересечение Южного шоссе и ул. Льва Яшина, рядом с домом № 25.',
      openingHours: 'Круглосуточно',
      price: 'Бесплатно',
    },
    map: {
      lat: 53.546291,
      lng: 49.362168,
    },
    facts: [
      'Летом 1995 года на Южном шоссе произошла авария, погибли люди, ехавшие в автомобиле. Выжившая собака осталась у дороги и в течение нескольких лет возвращалась к этому месту.',
      '7 лет ожидания. Оставшись в живых, пёс, получивший в народе клички Верный или Костик, не покидал место аварии и терпеливо ждал возвращения хозяев на протяжении семи лет.',
      'Жители ближайших домов и проезжающие мимо водители заботились о Верном - подкармливали пса, строили для него будку. Однако все попытки забрать его домой оказывались безуспешными – он неизменно возвращался на свой пост.',
      'В 2002 году Верный ушёл из жизни, его тело было найдено в близлежащем лесу.',
      'Памятник был создан на народные пожертвования. Бронзовую скульптуру высотой ~1,5 метра изваял ульяновский скульптор Олег Клюев. Она установлена на постаменте на пересечении Южного шоссе и улицы Льва Яшина.',
      'Монумент был торжественно открыт в июне 2003 года на месте событий. Собрано пожертвований на ~250 000 рублей.',
      'Считается одним из первых неполитических монументов современного Тольятти.',
      'Памятник стал узнаваемым символом Тольятти и частой точкой в маршруте свадебных кортежей. Считается, что если потереть нос скульптуры и загадать желание, то оно обязательно сбудется.',
    ],
    history: {
      items: [
        'История Памятника преданности берёт начало в 1995 году. Тогда на оживлённом Южном шоссе произошла автокатастрофа, в которой погибли хозяева немецкой овчарки. Выживший пёс остался на обочине и начал многолетнее ожидание.',
        'Семь лет он был символом безусловной любви и преданности. Местные жители сроднились с псом, построили ему будку, подкармливали, но так и не смогли приручить и забрать домой – он всегда возвращался. В 2002 году он умер.',
        'Горожане, тронутые историей, сначала установили щит с надписью «Псу, научившему нас любви и преданности». А на народные средства, собранные всем городом и Ротари-клубом «Тольятти», ульяновский скульптор Олег Клюев создал бронзовый памятник.',
        'Фигура овчарки высотой в полтора метра словно вглядывается в дорогу – по замыслу автора, проезжающим водителям кажется, что собака поворачивает голову вслед за машинами, продолжая надеяться. Это место стало символом города и напоминанием о том, что такое настоящая верность.',
      ],
      quote: '«Псу, научившему нас любви и преданности» (с) Надпись на первоначальном памятном щите',
    },
    legends: [
      'Истинное имя пса, как и имена его погибших хозяев, навсегда останутся загадкой. В народе закрепились две клички: Верный – за его главное качество, и Костик – уменьшительное от Константин, что означает «постоянный».',
      'По свидетельствам очевидцев пёс Верный особенно бурно реагировал на проезжавшие мимо вишнёвые “девятки”, какая была у хозяина, будто задавалась вопросом «Не ты ли это проезжаешь мимо?» или «Где мой друг?».',
      'У этой трогательной истории есть и драматическая, но неподтверждённая версия. Согласно ей, в злополучной вишнёвой «девятке» находилась молодая пара, возвращавшаяся из свадебного путешествия. Эта легенда может объяснять, почему памятник стал местом паломничества молодожёнов.',
      'Сегодня они приезжают к бронзовому псу, чтобы поклясться друг другу в верности и потереть его нос на удачу.',
      'Многие задаются вопросом: почему собака не признала других хозяев? Возможно, Верный не просто ждал, а был действительно постоянным в своей преданности и хранил верность своему единственному человеку – другу. Сложно себе представить, что это возможно в отношениях «просто питомец – хозяин». Его история показывает, что, возможно, собаки способны на глубокие и сильные чувства. Пёс не ушёл, несмотря на длительное отсутствие комфортных условий, и его фигура, застывшая в бронзе, напоминает о том, насколько ценна и сильна преданность, которую люди хотели бы переживать по отношению к себе и к близким.',
    ],
    audioGuides: [
      'https://disk.yandex.ru/d/h-vRsUEet3hhDQ/%D0%9A%D0%9E%D0%9D%D0%A2%D0%95%D0%9D%D0%A2/1.%20%D0%9F%D0%B0%D0%BC%D1%8F%D1%82%D0%BD%D0%B8%D0%BA%20%D0%BF%D1%80%D0%B5%D0%B4%D0%B0%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D0%B8.%20%D0%A2%D0%BE%D0%BB%D1%8C%D1%8F%D1%82%D1%82%D0%B8/%D0%90%D1%83%D0%B4%D0%B8%D0%BE%D0%B3%D0%B8%D0%B4%201%20%D0%9F%D0%B0%D0%BC%D1%8F%D1%82%D0%BD%D0%B8%D0%BA%20%D0%9F%D1%80%D0%B5%D0%B4%D0%B0%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D1%82%D0%B8%20.MP3',
      'https://disk.yandex.ru/d/h-vRsUEet3hhDQ/%D0%9A%D0%9E%D0%9D%D0%A2%D0%95%D0%9D%D0%A2/1.%20%D0%9F%D0%B0%D0%BC%D1%8F%D1%82%D0%BD%D0%B8%D0%BA%20%D0%BF%D1%80%D0%B5%D0%B4%D0%B0%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D0%B8.%20%D0%A2%D0%BE%D0%BB%D1%8C%D1%8F%D1%82%D1%82%D0%B8/%D0%90%D1%83%D0%B4%D0%B8%D0%BE%D0%B3%D0%B8%D0%B42%20%D0%9F%D0%B0%D0%BC%D1%8F%D1%82%D0%BD%D0%B8%D0%BA%20%D0%9F%D1%80%D0%B5%D0%B4%D0%B0%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D0%B8.MP3',
    ],
    gallery: [
      gallery1,
      gallery2,
      gallery3,
      gallery4,
      gallery5,
      gallery6,
      gallery7,
      gallery8,
      gallery9,
      gallery10,
      gallery11,
      gallery12,
      gallery13,
      gallery14,
      gallery15,
      gallery16,
      gallery17,
      gallery18,
      gallery19,
      gallery20,
      gallery21,
    ].map((image) => image.src),
  },
};
